Учет_ФК/src/Documents/ПередачаПродукцииВПереработку/ПередачаПродукцииВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаПродукцииВПереработку</name>
  <registerRecords>AccumulationRegister.ПереработкаПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПродукцииНаСкладе</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаРаботы</name>
    <type>
      <types>CatalogRef.СменыРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияПродукции</name>
      <type>
        <types>CatalogRef.ПартииПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/AccumulationRegisters/ОстаткиПродукцииНаСкладе/ОстаткиПродукцииНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПродукцииНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияПродукции</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеХраниния</name>
    <type>
      <types>EnumRef.СостоянияХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_ФК/src/AccumulationRegisters/ПереработкаПродукции/ПереработкаПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПереработкаПродукции</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияПродукции</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_ФК/src/InformationRegisters/ДанныеЗатаркиТранспортировочныхМест/ДанныеЗатаркиТранспортировочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЗатаркиТранспортировочныхМест</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/Enums/СостоянияХранения/СостоянияХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияХранения</name>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>Транспортировка</name>
  </enumValues>
  <enumValues>
    <name>ХранениеНекондиции</name>
  </enumValues>
</mdclass:Enum>

Учет_ФК/src/Documents/ПередачаПродукцииВПереработку/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию(ПараметрыСеанса.ТекущийПользователь.Наименование);	
	Склад = Справочники.Склады.СкладПоУмолчанию(ПараметрыСеанса.ТекущийПользователь.Наименование);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиПродукцииНаСкладе.Очистить();
	Движения.ОстаткиПродукцииНаСкладе.Записать(Истина);
	
	Движения.ПереработкаПродукции.Очистить();
	Движения.ПереработкаПродукции.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПродукцииНаСкладеОстатки.Организация КАК Организация,
		|	ОстаткиПродукцииНаСкладеОстатки.Склад КАК Склад,
		|	ОстаткиПродукцииНаСкладеОстатки.ПартияПродукции КАК ПартияПродукции,
		|	ОстаткиПродукцииНаСкладеОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиПродукцииНаСкладеОстатки.ТранспортировочноеМесто КАК ТранспортировочноеМесто,
		|	СУММА(ОстаткиПродукцииНаСкладеОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ОстаткиПродукцииНаСкладеОстатки.КоличествоМестОстаток) КАК КоличествоМестОстаток,
		|	ДанныеЗатаркиТранспортировочныхМест.Влажность КАК Влажность,
		|	0 КАК КоличествоСписано,
		|	СУММА(ОстаткиПродукцииНаСкладеОстатки.ВесБруттоВлажныйОстаток) КАК ВесБруттоВлажныйОстаток,
		|	СУММА(ОстаткиПродукцииНаСкладеОстатки.ВесНеттоВлажныйОстаток) КАК ВесНеттоВлажныйОстаток,
		|	СУММА(ОстаткиПродукцииНаСкладеОстатки.ВесНеттоСухойОстаток) КАК ВесНеттоСухойОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиПродукцииНаСкладе.Остатки(
		|			&МоментВремени,
		|			ТранспортировочноеМесто В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ПередачаПродукцииВПереработкуПродукция.ТранспортировочноеМесто КАК ТранспортировочноеМесто
		|					ИЗ
		|						Документ.ПередачаПродукцииВПереработку.Продукция КАК ПередачаПродукцииВПереработкуПродукция
		|					ГДЕ
		|						ПередачаПродукцииВПереработкуПродукция.Ссылка = &СсылкаНаДокумент)
		|				И Организация = &Организация
		|				И Склад = &Склад
		|				И СостояниеХраниния = ЗНАЧЕНИЕ(перечисление.СостоянияХранения.Хранение)) КАК ОстаткиПродукцииНаСкладеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеЗатаркиТранспортировочныхМест КАК ДанныеЗатаркиТранспортировочныхМест
		|		ПО ОстаткиПродукцииНаСкладеОстатки.ТранспортировочноеМесто = ДанныеЗатаркиТранспортировочныхМест.ТранспортировочноеМесто
		|ГДЕ
		|	ДанныеЗатаркиТранспортировочныхМест.ТранспортировочноеМесто В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ПередачаПродукцииВПереработкуПродукция.ТранспортировочноеМесто КАК ТранспортировочноеМесто
		|			ИЗ
		|				Документ.ПередачаПродукцииВПереработку.Продукция КАК ПередачаПродукцииВПереработкуПродукция
		|			ГДЕ
		|				ПередачаПродукцииВПереработкуПродукция.Ссылка = &СсылкаНаДокумент)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПродукцииНаСкладеОстатки.Номенклатура,
		|	ОстаткиПродукцииНаСкладеОстатки.Организация,
		|	ОстаткиПродукцииНаСкладеОстатки.ПартияПродукции,
		|	ОстаткиПродукцииНаСкладеОстатки.ТранспортировочноеМесто,
		|	ОстаткиПродукцииНаСкладеОстатки.Склад,
		|	ДанныеЗатаркиТранспортировочныхМест.Влажность
		|
		|ДЛЯ ИЗМЕНЕНИЯ";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СсылкаНаДокумент", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	Для каждого СтрокаТаблицы из Продукция Цикл 
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ПартияПродукции", СтрокаТаблицы.ПартияПродукции);
		СтруктураПоиска.Вставить("ТранспортировочноеМесто",СтрокаТаблицы.ТранспортировочноеМесто);
		
		МассивСтрокОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтрокОстатков.Количество()  = 0 Тогда 
			ТекстСообщения = "В строке №"+Формат(СтрокаТаблицы.НомерСтроки,"ЧГ=")+" не корректно указано транспортировочное место."+ Символы.ПС +
							"По данным учета на складе """+Склад.Наименование+""" не числится транспортировочное место № " + СтрокаТаблицы.ТранспортировочноеМесто + Символы.ПС+
							"из партии продукции № " + СтрокаТаблицы.ПартияПродукции.Код;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "", "Объект", Отказ);
			Отказ = Истина;	
		Иначе
			СтрокаТаблицыОстатков = МассивСтрокОстатков[0];
			
			Если СтрокаТаблицыОстатков.КоличествоМестОстаток >= 1 Тогда
				Движения.ОстаткиПродукцииНаСкладе.Записывать = Истина;
				
				СтрокаТаблицыОстатков.КоличествоМестОстаток = СтрокаТаблицыОстатков.КоличествоМестОстаток - 1;
				СтрокаТаблицыОстатков.КоличествоСписано = СтрокаТаблицыОстатков.КоличествоСписано + 1;
				
				Движение 				= Движения.ОстаткиПродукцииНаСкладе.Добавить();
				Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Склад 			= Склад;
				Движение.ПартияПродукции = СтрокаТаблицы.ПартияПродукции;
				Движение.Номенклатура 	= СтрокаТаблицы.ПартияПродукции.Номенклатура;
				Движение.ТранспортировочноеМесто = СтрокаТаблицы.ТранспортировочноеМесто;
				Движение.СостояниеХраниния = Перечисления.СостоянияХранения.Хранение;
				Движение.Количество 		= СтрокаТаблицыОстатков.КоличествоОстаток;
				Движение.КоличествоМест 	= 1;
				Движение.ВесНеттоСухой		= СтрокаТаблицыОстатков.ВесНеттоСухойОстаток;
				Движение.ВесНеттоВлажный	= СтрокаТаблицыОстатков.ВесНеттоВлажныйОстаток;
				Движение.ВесБруттоВлажный	= СтрокаТаблицыОстатков.ВесБруттоВлажныйОстаток;
				
				//ПЕРЕРАБОТКА ПРОДУКЦИИ
				Движение 							= Движения.ПереработкаПродукции.Добавить();
				Движение.Период 					= Дата;
				Движение.Организация 				= Организация;
				Движение.Смена		 				= СменаРаботы;
				Движение.Номенклатура 				= СтрокаТаблицы.ПартияПродукции.Номенклатура;
				Движение.ПартияПродукции		 	= СтрокаТаблицы.ПартияПродукции;
				Движение.ТранспортировочноеМесто 	= СтрокаТаблицы.ТранспортировочноеМесто;
				Движение.ВесБруттоВлажный 			= СтрокаТаблицыОстатков.ВесБруттоВлажныйОстаток;
				Движение.ВесНеттоВлажный 			= СтрокаТаблицыОстатков.ВесНеттоВлажныйОстаток;
				Движение.ВесНеттоСухой 				= СтрокаТаблицыОстатков.ВесНеттоСухойОстаток;
				
			Иначе
				ТекстСообщения = "В строке №"+Формат(СтрокаТаблицы.НомерСтроки,"ЧГ=")+" не корректно указано транспортировочное место."+ Символы.ПС +
								"По данным учета на складе """+Склад.Наименование+""" не числится транспортировочное место № " + СтрокаТаблицы.ТранспортировочноеМесто + Символы.ПС+
								"из партии продукции № " + СтрокаТаблицы.ПартияПродукции.Код;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "", "Объект", Отказ);
				Отказ = Истина;	
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
